# TabbedDialogExtension Methods

---
The TabbedDialogExtension type exposes the following members.
| Name| Description
---|---|---
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetContextualHelp| Gets the contextual help.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| SetContextualHelp| Sets the contextual help.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
TabbedDialogExtension Class
Autodesk.Revit.UI Namespace